src/mp_toir/Documents/РегистрацияДефекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистрацияДефекта</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписаниеДефекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДефекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Критичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мечел_КритичностьДефекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаУстранение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дефекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мечел_ДефектыОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУстранения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Мечел_СпособыУстраненияДефектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДефектУстранен</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстранения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеУстранения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияДефекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиФиксацииДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоДефекта</Name>
							<Comment>Для выгрузки в ЕРП</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоДефектаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияУстранения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиУстраненияДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоУстранения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоУстраненияПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/СтатусыДефектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДефектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
					<Comment>Внесена запись о дефекте. Черновик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Признан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноУстранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Устранен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/мп_ИсточникиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_ИсточникиДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МечелТОиР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/РегистрацияДефекта/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	СортировкаПоДате();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ДоступностьОтбора = ОбщегоНазначенияВызовСервера.ДоступностьПараметраОтбораДокументов(ТекущийПользователь);

	Если Не ДоступностьОтбора = Неопределено Тогда
		Элементы.ПодразделениеОтбор.Доступность = ДоступностьОтбора.Подразделение;
		Элементы.ОтветственныйОтбор.Доступность = ДоступностьОтбора.Ответственный;
		Если РольДоступна("мп_ДобавлениеИзменениеДокументовТОиР") Или РольДоступна("мп_БригадирТОиР") Тогда
			ЭтотОбъект.Подразделение = РеквизитыКонстант["ПодразделениеПользователя"];
			ЭтотОбъект.Ответственный = ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.СтатусОбмена.Добавить(Перечисления.мп_СтатусыОбмена.Создан);
	ЭтотОбъект.СтатусОбмена.Добавить(Перечисления.мп_СтатусыОбмена.ЗагруженИзКИС);

	ЭтотОбъект.Статус.Добавить(Перечисления.СтатусыДефектов.Зарегистрирован);
	ЭтотОбъект.Статус.Добавить(Перечисления.СтатусыДефектов.Признан);
	ЭтотОбъект.Статус.Добавить(Перечисления.СтатусыДефектов.Устранен);
	ЭтотОбъект.Статус.Добавить(Перечисления.СтатусыДефектов.ОтложеноУстранение);

	НастройкиПоУмолчанию = Новый Структура;
	НастройкиПоУмолчанию.Вставить("СтатусОбмена", ЭтотОбъект.СтатусОбмена);
	НастройкиПоУмолчанию.Вставить("Статус", ЭтотОбъект.Статус);
	
	ПерсональныеНастройки = ОбщегоНазначенияВызовСервера.ПолучитьПерсональныеНастройки(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, НастройкиПоУмолчанию);

	ЭтотОбъект.Статус = ПерсональныеНастройки["Статус"];
	ЭтотОбъект.СтатусОбмена = ПерсональныеНастройки["СтатусОбмена"];
	
	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	ЭтотОбъект.ПраваДоступаТекущегоПользователя = ПраваДоступа;
	
	ОтборСпискаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	ПриЗакрытииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ОбщегоНазначенияВызовСервера.СохранитьПерсональнуюНастройку(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, "СтатусОбмена", ЭтотОбъект.СтатусОбмена);
		
	ОбщегоНазначенияВызовСервера.СохранитьПерсональнуюНастройку(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, "Статус", ЭтотОбъект.Статус);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеОтборОчистка(Элемент, СтандартнаяОбработка)
	ПраваДоступа = ЭтотОбъект.ПраваДоступаТекущегоПользователя;
	Если ПраваДоступа.БригадирТОиР Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйЗаУстранениеОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОтветственныеЗаУстранение = СписокОтветственных(ЭтотОбъект.Подразделение);
	
	Если Не ОтветственныеЗаУстранение = Неопределено Тогда
		МассивЭлементов = Новый Массив;
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ОтветственныеЗаУстранение);
		МассивЭлементов.Добавить(НовыйПараметр);
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКИСОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ДокументыОтбора = СписокДокументовСНомерамиКИС(ЭтотОбъект.Подразделение, ЭтотОбъект.Ответственный);

	Если Не ДокументыОтбора = Неопределено Тогда
		МассивЭлементов = Новый Массив;
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ДокументыОтбора);
		МассивЭлементов.Добавить(НовыйПараметр);
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НомерКИСОтборПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОтборПриИзменении(Элемент)

	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйОтборПриИзменении(Элемент)
	
	ОтборСпискаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйЗаУстранениеОтборПриИзменении(Элемент)

	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭксплуатацииОтборПриИзменении(Элемент)

	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ВыбранныеПодразделения = ОбщегоНазначенияВызовСервера.ПодразделенияПользователей();

	Если ВыбранныеПодразделения.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;

	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ВыбранныеПодразделения);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СтатусОбменаОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СписокВыбора = ОбщегоНазначенияКлиент.СтатусыОбменаКлиент(ЭтотОбъект.СтатусОбмена);

	ВыбранноеЗначение = Ждать СписокВыбора.ОтметитьЭлементыАсинх("Выберите статусы");
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ЭтотОбъект.СтатусОбмена.Очистить();
	Для Каждого ТекСтатус Из ВыбранноеЗначение Цикл
		Если ТекСтатус.Пометка Тогда
			ЭтотОбъект.СтатусОбмена.Добавить(ТекСтатус.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Асинх Процедура СтатусОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СписокВыбора = СтатусыДефектовКлиент(ЭтотОбъект.Статус);

	ВыбранноеЗначение = Ждать СписокВыбора.ОтметитьЭлементыАсинх("Выберите статусы");
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ЭтотОбъект.Статус.Очистить();
	Для Каждого ТекСтатус Из ВыбранноеЗначение Цикл
		Если ТекСтатус.Пометка Тогда
			ЭтотОбъект.Статус.Добавить(ТекСтатус.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Функция СтатусыДефектовКлиент(ТекущийСтатусОбмена) Экспорт

	АктуальныеСтатусы = Новый Массив;
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыДефектов.Зарегистрирован"));
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыДефектов.Отклонен"));
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыДефектов.Признан"));
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыДефектов.ОтложеноУстранение"));
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыДефектов.Устранен"));
	
	СписокВыбора = Новый СписокЗначений;
	Для Каждого СтатусОбменаКлиент Из АктуальныеСтатусы Цикл
		Пометка = ?(ТекущийСтатусОбмена.НайтиПоЗначению(СтатусОбменаКлиент) = Неопределено, Ложь, Истина);
		СписокВыбора.Добавить(СтатусОбменаКлиент, , Пометка);
	КонецЦикла;

	Возврат СписокВыбора;

КонецФункции

&НаКлиенте
Процедура СтатусОбменаОтборУдалениеМножественныхЗначений(Элемент, Идентификаторы, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Для Каждого ТекИдентификатор Из Идентификаторы Цикл
		УдаляемыйЭлемент = ЭтотОбъект.СтатусОбмена.НайтиПоИдентификатору(ТекИдентификатор);
		ЭтотОбъект.СтатусОбмена.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СтатусОтборУдалениеМножественныхЗначений(Элемент, Идентификаторы, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Для Каждого ТекИдентификатор Из Идентификаторы Цикл
		УдаляемыйЭлемент = ЭтотОбъект.Статус.НайтиПоИдентификатору(ТекИдентификатор);
		ЭтотОбъект.Статус.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	ОтборСпискаНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроведениеДокументаАдминистратором(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДокПроведения = ДопПараметры.ДокПроведения;
		ПровестиДокументСервер(ДокПроведения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменаПроведенияДокументаАдминистратором(РезультатВопроса, ДопПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДокПроведения = ДопПараметры.ДокПроведения;
		ПометкаОтменаПроведенияДокументСервер(ДокПроведения, Ложь, "ИнтерактивнаяОтменаПроведения");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПометкаУдаленияДокументаАдминистратором(РезультатВопроса, ДопПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДокПроведения = ДопПараметры.ДокПроведения;
		ПометкаОтменаПроведенияДокументСервер(ДокПроведения, Ложь, "ИнтерактивнаяПометкаУдаления");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)

	ДокПроведения = ЭтотОбъект.ТекущийЭлемент.ТекущаяСтрока;
	РеквизитыДокумента = РеквизитыДокумента(ДокПроведения);
	ТекущийИсточник = РеквизитыДокумента.Источник;
	Статус = РеквизитыДокумента.Статус;
	СтатусОбмена = РеквизитыДокумента.СтатусОбмена;
	ПометкаУдаления = РеквизитыДокумента.ПометкаУдаления;
	АдминТОиР = ОбщегоНазначенияВызовСервера.АдминистраторТОиР();
	
	Если ПометкаУдаления Тогда
		ПоказатьПредупреждение(,
			"Нельзя проводить помеченный на удаление документ, перед удалением снимите пометку удаления", 30, "Ошибка");
		Возврат;
	КонецЕсли;
	
	Если РегистрацияДефектаЛокализация.УсловиеОтбораДокумента(Статус, ТекущийИсточник, СтатусОбмена) Тогда
		Если АдминТОиР Тогда
			СтрСообщение = "Изменение документа в статусе %1 запрещено для пользователей с обычными правами. "
				+ "Внося изменения в документ, вы осознаёте риск искажения и рассинхронизации информации. Продолжить?";
			СтрСообщение = СтрШаблон(СтрСообщение, Статус);

			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ДокПроведения", ДокПроведения);
			ОповещениеПроведения = Новый ОписаниеОповещения("ПроведениеДокументаАдминистратором", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(ОповещениеПроведения,  СтрСообщение, РежимДиалогаВопрос.ДаНет, 60);
		КонецЕсли;
	Иначе
		ПровестиДокументСервер(ДокПроведения);
	КонецЕсли;

	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте 
Процедура ПоказатьВопросАдминТОиР(Знач ТекущийИсточник, Знач Статус, Знач ДокПроведения, Знач ПометкаУдаления, Знач ДействиеСДокументом)

	Если ДействиеСДокументом = "ИнтерактивнаяОтменаПроведения" Тогда
		ПроцедураОповещенияСтр = "ОтменаПроведенияДокументаАдминистратором";
	ИначеЕсли ДействиеСДокументом = "ИнтерактивнаяПометкаУдаления" Тогда
		Если ПометкаУдаления Тогда
			ПометкаОтменаПроведенияДокументСервер(ДокПроведения, Ложь, ДействиеСДокументом);
			Возврат;
		КонецЕсли;
		ПроцедураОповещенияСтр = "ПометкаУдаленияДокументаАдминистратором";
	КонецЕсли;
	ДопПараметр = Новый Структура;
	ДопПараметр.Вставить("ДокПроведения", ДокПроведения);
	
	ПроцедураОповещения = Новый ОписаниеОповещения(ПроцедураОповещенияСтр, ЭтотОбъект, ДопПараметр);
	СтрСообщение = "Изменение документа в статусе %1 запрещено для пользователей с обычными правами. "
	+ "Внося изменения в документ, вы осознаёте риск искажения и рассинхронизации информации. Продолжить?";
	СтрСообщение = СтрШаблон(СтрСообщение, Статус);

	ПоказатьВопрос(ПроцедураОповещения, СтрСообщение, РежимДиалогаВопрос.ДаНет, 60);

КонецПроцедуры

&НаКлиенте
Процедура ПометкаУдаленияОтменаПроведения(ДействиеСДокументом)
	
	ДокПроведения = ЭтотОбъект.ТекущийЭлемент.ТекущаяСтрока;
	РеквизитыДокумента = РеквизитыДокумента(ДокПроведения);
	ПометкаУдаления = РеквизитыДокумента.ПометкаУдаления;
	ТекущийИсточник = РеквизитыДокумента.Источник;
	Статус = РеквизитыДокумента.Статус;
	СтатусОбмена = РеквизитыДокумента.СтатусОбмена;
	АдминТОиР = ОбщегоНазначенияВызовСервера.АдминистраторТОиР();

	Если РегистрацияДефектаЛокализация.УсловиеОтбораДокумента(
		Статус, ТекущийИсточник, СтатусОбмена) Тогда
		Если АдминТОиР Тогда
			ПоказатьВопросАдминТОиР(ТекущийИсточник, Статус, ДокПроведения, ПометкаУдаления, ДействиеСДокументом);
		Иначе
			ПометкаОтменаПроведенияДокументСервер(ДокПроведения, Истина, ДействиеСДокументом);
		КонецЕсли;
	Иначе
		Если ТекущийИсточник = ПредопределенноеЗначение("Перечисление.мп_ИсточникиДокументов.КИС") Тогда
			Если АдминТОиР Тогда
				Если ДействиеСДокументом = "ИнтерактивнаяОтменаПроведения" Тогда
					СтрСообщение = "Факт отмены проведения не будет выгружен в КИС";
				ИначеЕсли ДействиеСДокументом = "ИнтерактивнаяПометкаУдаления" Тогда
					Если ПометкаУдаления Тогда
						СтрСообщение = "Снятие пометки на удаление не будет выгружено в КИС";
					Иначе
						СтрСообщение = "Пометка на удаление не будет выгружена в КИС";
					КонецЕсли;
				КонецЕсли;
				ПоказатьПредупреждение(, СтрСообщение, 30, "Предупреждение");
				ПометкаОтменаПроведенияДокументСервер(ДокПроведения, Ложь, ДействиеСДокументом);
			Иначе
				ПометкаОтменаПроведенияДокументСервер(ДокПроведения, Истина, ДействиеСДокументом);
			КонецЕсли;
		Иначе
			ПометкаОтменаПроведенияДокументСервер(ДокПроведения, Истина, ДействиеСДокументом);	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведениеДокумента(Команда)

	ПометкаУдаленияОтменаПроведения("ИнтерактивнаяОтменаПроведения");

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаленияДокумента(Команда)

	ПометкаУдаленияОтменаПроведения("ИнтерактивнаяПометкаУдаления");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПравоНаДокумент(Знач ВидПроверки)
	Возврат ПравоДоступа(ВидПроверки, Метаданные.Документы.РегистрацияДефекта);
КонецФункции

&НаСервере
Процедура ПометкаОтменаПроведенияДокументСервер(Знач ДокПроведения, ВыполнитьПроверку, ДействиеСДокументом)

	ПроверкаПройдена = ПравоНаДокумент(ДействиеСДокументом);
	Если Не ПроверкаПройдена Тогда
		Возврат;
	КонецЕсли;
	ДокОбъект = ДокПроведения.ПолучитьОбъект();
	РеквизитыДокумента = 
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокПроведения, "СтатусОбмена, Источник");
	Если ВыполнитьПроверку Тогда
		ПроверкаПройдена = Не ОбщегоНазначенияСервер.ЗапретПометкиУдаленияДокументовТОиР(
			РеквизитыДокумента.СтатусОбмена, РеквизитыДокумента.Источник);
	Иначе
		ПроверкаПройдена = Истина;
	КонецЕсли;

	Если ПроверкаПройдена Тогда
		Если ДействиеСДокументом = "ИнтерактивнаяОтменаПроведения" Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли ДействиеСДокументом = "ИнтерактивнаяПометкаУдаления" Тогда
			Действие = Не ДокПроведения.ПометкаУдаления;
			ДокОбъект.УстановитьПометкуУдаления(Действие);
		КонецЕсли;
		УзелОбмена = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ДокПроведения);
		ОбновитьСписок();
	Иначе
		ИсточникКИС = (РеквизитыДокумента.Источник = Перечисления.мп_ИсточникиДокументов.КИС);
		СтатусДокумента = Перечисления.мп_СтатусыОбмена.СтатусПредставленияДокумента(РеквизитыДокумента.СтатусОбмена);
		Если ДействиеСДокументом = "ИнтерактивнаяОтменаПроведения" Тогда
			Если ИсточникКИС Тогда
				СообщениеПользователю = "Документ загружен из КИС: нельзя отменять проведение";
			Иначе
				СообщениеПользователю = СтатусДокумента + ": нельзя отменять проведение";
			КонецЕсли;
		ИначеЕсли ДействиеСДокументом = "ИнтерактивнаяПометкаУдаления" Тогда
			Если ИсточникКИС Тогда
				СообщениеПользователю = "Документ загружен из КИС: нельзя помечать на удаление";
			Иначе
				СообщениеПользователю = СтатусДокумента + ": Нельзя помечать на удаление";
			КонецЕсли;
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(СообщениеПользователю);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПровестиДокументСервер(Знач ДокПроведения)

	Если Не ПравоНаДокумент("ИнтерактивноеПроведение") Тогда
		Возврат;
	КонецЕсли;

	Если ДокПроведения.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	ДокОбъект = ДокПроведения.ПолучитьОбъект();
	ПроверкаПройдена = ДокОбъект.ПроверитьЗаполнение();
	Если ПроверкаПройдена Тогда
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ОбновитьСписок();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыДокумента(ДокПроведения)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокПроведения, "Источник, ПометкаУдаления, Статус, СтатусОбмена");
КонецФункции

&НаСервереБезКонтекста
Функция СписокОтветственных(Знач Подразделение)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК ОтветственныеЗаУстранение
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) = &Подразделение
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Пользователи.Подразделение = &Подразделение
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ОтветственныеЗаУстранение");
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокДокументовСНомерамиКИС(Знач Подразделение, Знач Ответственный)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрацияДефекта.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РегистрацияДефекта КАК РегистрацияДефекта
	|ГДЕ
	|	НЕ СОКРЛП(РегистрацияДефекта.НомерКИС) = """"
	|	И ВЫБОР
	|			КОГДА &Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РегистрацияДефекта.Подразделение = &Подразделение
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Ответственный = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РегистрацияДефекта.Ответственный = &Ответственный
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ОтборСпискаНаСервере()

	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", ЭтотОбъект.Подразделение);
	Список.Параметры.УстановитьЗначениеПараметра("Ответственный", ЭтотОбъект.Ответственный);
	Список.Параметры.УстановитьЗначениеПараметра(
		"ТекущийПользовательБригадир", ЭтотОбъект.ПраваДоступаТекущегоПользователя.БригадирТОиР);
	Список.Параметры.УстановитьЗначениеПараметра("НомерКИС", ЭтотОбъект.НомерКИСОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("ОтветственныйЗаУстранение", ЭтотОбъект.ОтветственныйЗаУстранение);
	Список.Параметры.УстановитьЗначениеПараметра("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);

	СтатусыОбменаВЗапрос = Новый Массив;
	Для Каждого ТекСтатус Из ЭтотОбъект.СтатусОбмена Цикл
		СтатусыОбменаВЗапрос.Добавить(ТекСтатус.Значение);
	КонецЦикла;
	Список.Параметры.УстановитьЗначениеПараметра("СтатусыОбмена", СтатусыОбменаВЗапрос);
	
	СтатусыДефектов = Новый Массив;
	Для Каждого ТекСтатус Из ЭтотОбъект.Статус Цикл
		СтатусыДефектов.Добавить(ТекСтатус.Значение);
	КонецЦикла;
	Список.Параметры.УстановитьЗначениеПараметра("СтатусыДефектов", СтатусыДефектов);
	
	СортировкаПоДате();
	
КонецПроцедуры

&НаСервере
Процедура СортировкаПоДате()
	Порядок = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		Список.Порядок.ИдентификаторПользовательскойНастройки);
	Порядок.Элементы.Очистить();
	НовыйПорядок = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	НовыйПорядок.Поле = Новый ПолеКомпоновкиДанных("Дата");
	НовыйПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	НовыйПорядок.Использование = Истина;
	ОбновитьСписок();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()

	Элементы.Список.Обновить();

КонецПроцедуры

#КонецОбласти
